wtvemac/mame/src/mame/webtv/lpc47m192.cpp
// license: BSD-3-Clause
// copyright-holders: wtvemac

// Can also be in src/devices/bus/isa/

// Description here

#include "emu.h"
#include "lpc47m192.h"
#include "bus/centronics/ctronics.h"
#include "bus/rs232/null_modem.h"
#include "machine/pckeybrd.h"
#include "ps2_mouse.h"

DEFINE_DEVICE_TYPE(LPC47M192, lpc47m192_device, "lpc47m192", "SMSC LPC47M192 Super I/O")

lpc47m192_device::lpc47m192_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: device_t(mconfig, LPC47M192, tag, owner, clock),
	device_isa16_card_interface(mconfig, *this),
	m_serial(*this, "serial%d", 1),
	m_parallel(*this, "parallel"),
	m_kbdc(*this, "kbdc"),
	m_kbd(*this, finder_base::DUMMY_TAG),
	m_irq1_cb(*this),
	m_irq2_cb(*this),
	m_irq3_cb(*this),
	m_irq4_cb(*this),
	m_irq5_cb(*this),
	m_irq6_cb(*this),
	m_irq7_cb(*this),
	m_irq8_cb(*this),
	m_irq9_cb(*this),
	m_irq10_cb(*this),
	m_irq11_cb(*this),
	m_irq12_cb(*this),
	m_irq13_cb(*this),
	m_irq14_cb(*this),
	m_irq15_cb(*this),
	m_system_reset_cb(*this),
	m_gate_a20_cb(*this),
	m_par_h2dd0_w_cb(*this),
	m_par_h2dd1_w_cb(*this),
	m_par_h2dd2_w_cb(*this),
	m_par_h2dd3_w_cb(*this),
	m_par_h2dd4_w_cb(*this),
	m_par_h2dd5_w_cb(*this),
	m_par_h2dd6_w_cb(*this),
	m_par_h2dd7_w_cb(*this),
	m_par_h2dc0_w_cb(*this),
	m_par_h2dc1_w_cb(*this),
	m_par_h2dc2_w_cb(*this),
	m_par_h2dc3_w_cb(*this),
	m_par_h2dc4_w_cb(*this),
	m_s1_txd_w_cb(*this),
	m_s1_dtr_w_cb(*this),
	m_s1_rts_w_cb(*this),
	m_s2_txd_w_cb(*this),
	m_s2_dtr_w_cb(*this),
	m_s2_rts_w_cb(*this),
	m_kbdc_kbd_in_w_cb(*this),
	m_kbdc_mse_in_w_cb(*this),
	m_runtime_in_cb(*this, 0),
	m_runtime_out_cb(*this)
{
	m_sysopt = lpc47m192_device::OPTS_SYSOPT_LOW;
}

void lpc47m192_device::device_start()
{
	lpc47m192_device::set_isa_device();

	lpc47m192_device::set_default_values();

	m_kbdc->keyboard_enable(!m_kbdc_kbd_in_w_cb.isunset());
	m_kbdc->mouse_enable(!m_kbdc_mse_in_w_cb.isunset());
}

void lpc47m192_device::device_reset()
{
	lpc47m192_device::set_default_values();
}

void lpc47m192_device::device_add_mconfig(machine_config &config)
{
	// FDC

	// parallel port controller
	ECP_LPT(config, m_parallel, 0);
	m_parallel->irq_handler().set(FUNC(lpc47m192_device::irq_parallel_w));
	m_parallel->hst2dev_pdata_bit_handler<0>().set([this] (int state) { m_par_h2dd0_w_cb(state); });
	m_parallel->hst2dev_pdata_bit_handler<1>().set([this] (int state) { m_par_h2dd1_w_cb(state); });
	m_parallel->hst2dev_pdata_bit_handler<2>().set([this] (int state) { m_par_h2dd2_w_cb(state); });
	m_parallel->hst2dev_pdata_bit_handler<3>().set([this] (int state) { m_par_h2dd3_w_cb(state); });
	m_parallel->hst2dev_pdata_bit_handler<4>().set([this] (int state) { m_par_h2dd4_w_cb(state); });
	m_parallel->hst2dev_pdata_bit_handler<5>().set([this] (int state) { m_par_h2dd5_w_cb(state); });
	m_parallel->hst2dev_pdata_bit_handler<6>().set([this] (int state) { m_par_h2dd6_w_cb(state); });
	m_parallel->hst2dev_pdata_bit_handler<7>().set([this] (int state) { m_par_h2dd7_w_cb(state); });
	m_parallel->hst2dev_cntl_bit_handler<0>().set([this] (int state) { m_par_h2dc0_w_cb(state); });
	m_parallel->hst2dev_cntl_bit_handler<1>().set([this] (int state) { m_par_h2dc1_w_cb(state); });
	m_parallel->hst2dev_cntl_bit_handler<2>().set([this] (int state) { m_par_h2dc2_w_cb(state); });
	m_parallel->hst2dev_cntl_bit_handler<3>().set([this] (int state) { m_par_h2dc3_w_cb(state); });
	m_parallel->hst2dev_cntl_bit_handler<4>().set([this] (int state) { m_par_h2dc4_w_cb(state); });

	// SERIAL1 port controller
	NS16550(config, m_serial[0], XTAL(1'843'200));
	m_serial[0]->out_int_callback().set(FUNC(lpc47m192_device::irq_serial1_w));
	m_serial[0]->out_tx_callback().set([this] (int state) { m_s1_txd_w_cb(state); });
	m_serial[0]->out_dtr_callback().set([this] (int state) { m_s1_dtr_w_cb(state); });
	m_serial[0]->out_rts_callback().set([this] (int state) { m_s1_rts_w_cb(state); });

	// SERIAL2 port controller
	NS16550(config, m_serial[1], XTAL(1'843'200));
	m_serial[1]->out_int_callback().set(FUNC(lpc47m192_device::irq_serial2_w));
	m_serial[1]->out_tx_callback().set([this] (int state) { m_s2_txd_w_cb(state); });
	m_serial[1]->out_dtr_callback().set([this] (int state) { m_s2_dtr_w_cb(state); });
	m_serial[1]->out_rts_callback().set([this] (int state) { m_s2_rts_w_cb(state); });

	// Keyboard port controller
	LPC47M192_KBDC(config, m_kbdc);
	m_kbdc->system_reset_callback().set(FUNC(lpc47m192_device::system_reset_w));
	m_kbdc->gate_a20_callback().set(FUNC(lpc47m192_device::gate_a20_w));
	m_kbdc->keybd_output_buffer_full_callback().set(FUNC(lpc47m192_device::irq_keyboard_w));
	m_kbdc->mouse_output_buffer_full_callback().set(FUNC(lpc47m192_device::irq_mouse_w));
	m_kbdc->keyboard_in_w_callback().set([this] (uint8_t data) { m_kbdc_kbd_in_w_cb(data); });
	m_kbdc->mouse_in_w_callback().set([this] (uint8_t data)  { m_kbdc_mse_in_w_cb(data); });

	// GAME port controller

	// MIDI port controller
}

void lpc47m192_device::connect_pport_centronics(machine_config &config, const char* tag, lpc47m192_device::sopts_func_t slot_options_func, const char* default_option)
{
	centronics_device &centronics(CENTRONICS(config, tag, slot_options_func, default_option));

	centronics.set_data_input_buffer("lpc47m192:parallel:dev2hst_pdata");

	lpc47m192_device::parallel_data0_callback().set(tag, FUNC(centronics_device::write_data0));
	lpc47m192_device::parallel_data1_callback().set(tag, FUNC(centronics_device::write_data1));
	lpc47m192_device::parallel_data2_callback().set(tag, FUNC(centronics_device::write_data2));
	lpc47m192_device::parallel_data3_callback().set(tag, FUNC(centronics_device::write_data3));
	lpc47m192_device::parallel_data4_callback().set(tag, FUNC(centronics_device::write_data4));
	lpc47m192_device::parallel_data5_callback().set(tag, FUNC(centronics_device::write_data5));
	lpc47m192_device::parallel_data6_callback().set(tag, FUNC(centronics_device::write_data6));
	lpc47m192_device::parallel_data7_callback().set(tag, FUNC(centronics_device::write_data7));

