wtvemac/mame/src/mame/webtv/lpc47m192.cpp
	centronics.fault_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_status_wbit<3>));
	centronics.select_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_status_wbit<4>));
	centronics.perror_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_status_wbit<5>));
	centronics.ack_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_status_wbit<6>));
	centronics.busy_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_status_wbit<7>));

	centronics.strobe_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_control_wbit<0>));
	centronics.autofd_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_control_wbit<1>));
	centronics.init_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_control_wbit<2>));
	centronics.select_in_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_control_wbit<3>));

	lpc47m192_device::parallel_control0_callback().set(tag, FUNC(centronics_device::write_strobe));
	lpc47m192_device::parallel_control1_callback().set(tag, FUNC(centronics_device::write_autofd));
	lpc47m192_device::parallel_control2_callback().set(tag, FUNC(centronics_device::write_init));
	lpc47m192_device::parallel_control3_callback().set(tag, FUNC(centronics_device::write_select));
	lpc47m192_device::parallel_control4_callback().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::parallel_control_irq_enable_w));
}

void lpc47m192_device::connect_coma_rs232(machine_config &config, const char* tag, lpc47m192_device::sopts_func_t slot_options_func, const char* default_option)
{
	rs232_port_device &serial1_rs232(RS232_PORT(config, tag, slot_options_func, default_option));

	serial1_rs232.rxd_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial1_rx_w));
	serial1_rs232.dcd_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial1_dcd_w));
	serial1_rs232.dsr_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial1_dsr_w));
	serial1_rs232.ri_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial1_ri_w));
	serial1_rs232.cts_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial1_cts_w));

	lpc47m192_device::serial1_txd_callback().set(tag, FUNC(rs232_port_device::write_txd));
	lpc47m192_device::serial1_dtr_callback().set(tag, FUNC(rs232_port_device::write_dtr));
	lpc47m192_device::serial1_rts_callback().set(tag, FUNC(rs232_port_device::write_rts));
}

void lpc47m192_device::connect_comb_rs232(machine_config &config, const char* tag, lpc47m192_device::sopts_func_t slot_options_func, const char* default_option)
{
	rs232_port_device &serial2_rs232(RS232_PORT(config, tag, slot_options_func, default_option));

	serial2_rs232.rxd_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial2_rx_w));
	serial2_rs232.dcd_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial2_dcd_w));
	serial2_rs232.dsr_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial2_dsr_w));
	serial2_rs232.ri_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial2_ri_w));
	serial2_rs232.cts_handler().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::serial2_cts_w));

	lpc47m192_device::serial2_txd_callback().set(tag, FUNC(rs232_port_device::write_txd));
	lpc47m192_device::serial2_dtr_callback().set(tag, FUNC(rs232_port_device::write_dtr));
	lpc47m192_device::serial2_rts_callback().set(tag, FUNC(rs232_port_device::write_rts));
}

void lpc47m192_device::connect_kbdc_keyboard(machine_config &config, const char* tag)
{
	m_kbd.set_tag(tag);
	AT_KEYB(config, m_kbd, pc_keyboard_device::KEYBOARD_TYPE::AT, 1);
	m_kbd->keypress().set(
		[this] (int state)
		{
			if(state)
			{
				while(uint8_t data = m_kbd->read())
				{
					m_kbdc->keyboard_out_w(data);
				}
			}
		}
	);
	lpc47m192_device::keyboard_in_w_callback().set(m_kbd, FUNC(at_keyboard_device::write));
}

void lpc47m192_device::connect_kbdc_mouse(machine_config &config, const char* tag)
{
	ps2_mouse_device &mse(PS2_MOUSE(config, tag));
	mse.out_w_callback().set(lpc47m192_device::tag(), FUNC(lpc47m192_device::mouse_out_w));
	lpc47m192_device::mouse_in_w_callback().set(tag, FUNC(ps2_mouse_device::in_w));
}

void lpc47m192_device::set_default_values()
{
	m_config_enabled = false;

	m_config_control = 0x00;
	m_selected_ldevice = 0x00;
	m_device_id = lpc47m192_device::DEVICE_ID;
	m_device_rev = lpc47m192_device::DEVICE_REV;
	m_power_control = 0x00;
	m_power_mgmt = 0x00;
	m_osc = lpc47m192_device::OSC_DEFAULT;
	if(m_sysopt == lpc47m192_device::OPTS_SYSOPT_HIGH)
		m_config_initial_ioaddr = lpc47m192_device::DEFAULT_CONFIG_IOADDR2;
	else
		m_config_initial_ioaddr = lpc47m192_device::DEFAULT_CONFIG_IOADDR1;
	m_config_ioaddr = m_config_initial_ioaddr;

	m_fdd_enabled = false;
	m_fdd_ioaddr = lpc47m192_device::DEFAULT_FDD_IOADDR;
	m_fdd_int_sel = lpc47m192_device::DEFAULT_FDD_INT;
	m_fdd_dma_chan_sel = lpc47m192_device::DEFAULT_FDD_DMA_CHAN;
	m_fdd_mode = 0x00;
	m_fdd_option = 0x00;
	m_fdd_type = 0x00;
	m_fdd_0 = 0x00;
	m_fdd_1 = 0x00;

	m_parallel_enabled = false;
	m_parallel_ioaddr = lpc47m192_device::DEFAULT_PARALLEL_IOADDR;
	m_parallel_int_sel = lpc47m192_device::DEFAULT_PARALLEL_INT;
	m_parallel_dma_chan_sel = lpc47m192_device::DEFAULT_PARALLEL_DMA_CHAN;
	m_parallel_mode1 = 0x00;
	m_parallel_mode2 = 0x00;

	m_serial1_enabled = false;
	m_serial1_ioaddr = lpc47m192_device::DEFAULT_SERIAL1_IOADDR;
	m_serial1_int_sel = lpc47m192_device::DEFAULT_SERIAL1_INT;
	m_serial1_mode = 0x00;

	m_serial2_enabled = false;
	m_serial2_ioaddr = lpc47m192_device::DEFAULT_SERIAL2_IOADDR;
	m_serial2_int_sel = lpc47m192_device::DEFAULT_SERIAL2_INT;
	m_serial2_mode = 0x00;
	m_serial2_ir_options = 0x00;
	m_serial2_ir_hdtimeout = 0x00;

	m_kbd_enabled = false;
	m_kbd_ioaddr = lpc47m192_device::DEFAULT_KBD_IOADDR;
	m_kbd_pri_int_sel = lpc47m192_device::DEFAULT_KBD_PRI_INT;
	m_kbd_sec_int_sel = lpc47m192_device::DEFAULT_KBD_SEC_INT;
	m_a20_ioaddr = lpc47m192_device::DEFAULT_A20_IOADDR;
	m_kbd_reset_and_a20_sel = 0x00;

