wtvemac/mame/src/mame/webtv/lpc47m192.cpp
	m_game_enabled = false;
	m_game_ioaddr = lpc47m192_device::DEFAULT_GAME_IOADDR;

	m_runtime_enabled = false;
	m_runtime_ioaddr = lpc47m192_device::DEFAULT_RUNTIME_IOADDR;
	m_runtime_clocki32 = 0x00;

	m_midi_enabled = false;
	m_midi_ioaddr = lpc47m192_device::DEFAULT_MIDI_IOADDR;
	m_midi_int_sel = lpc47m192_device::DEFAULT_MIDI_INT;

	std::fill(std::begin(m_runtime_block), std::end(m_runtime_block), 0x00);

	lpc47m192_device::remap(AS_IO, 0x0000, 0xffff);
}

void lpc47m192_device::remap(int space_id, offs_t start, offs_t end)
{
	if (space_id == AS_IO)
		m_isa->install_device(0x0000, 0xffff, *this, &lpc47m192_device::io_map);
}

void lpc47m192_device::io_map(address_map &map)
{
	if(m_config_ioaddr < lpc47m192_device::IOADDR_MIN)
		m_config_ioaddr = m_config_initial_ioaddr;

	map(m_config_ioaddr + 0, m_config_ioaddr + 0).w(FUNC(lpc47m192_device::index_w));
	map(m_config_ioaddr + 1, m_config_ioaddr + 1).rw(FUNC(lpc47m192_device::data_r), FUNC(lpc47m192_device::data_w));

	//if(m_fdd_enabled && m_fdd_ioaddr >= lpc47m192_device::IOADDR_MIN)

	if(m_parallel_enabled && m_parallel_ioaddr >= lpc47m192_device::IOADDR_MIN)
	{
		map(m_parallel_ioaddr + 0, m_parallel_ioaddr + 7).rw(m_parallel, FUNC(ecp_lpt_device::read), FUNC(ecp_lpt_device::write));
		map(m_parallel_ioaddr + 0x400, m_parallel_ioaddr + 0x403).lrw8(
			NAME(
				[] (offs_t offset) -> uint8_t
				{
					return 0x00;
				}
			),
			NAME(
				[] (offs_t offset, uint8_t data)
				{
					//
				}
			)
		);
	}

	if(m_serial1_enabled && m_serial1_ioaddr >= lpc47m192_device::IOADDR_MIN)
		map(m_serial1_ioaddr + 0, m_serial1_ioaddr + 7).rw(m_serial[0], FUNC(ns16450_device::ins8250_r), FUNC(ns16450_device::ins8250_w));

	if(m_serial2_enabled && m_serial2_ioaddr >= lpc47m192_device::IOADDR_MIN)
		map(m_serial2_ioaddr + 0, m_serial2_ioaddr + 7).rw(m_serial[1], FUNC(ns16450_device::ins8250_r), FUNC(ns16450_device::ins8250_w));

	if(m_kbd_enabled)
	{
		map(m_kbd_ioaddr + 0, m_kbd_ioaddr + 0).rw(m_kbdc, FUNC(lpc47m192_kbdc_device::data_60r), FUNC(lpc47m192_kbdc_device::data_60w));
		map(m_kbd_ioaddr + 4, m_kbd_ioaddr + 4).rw(m_kbdc, FUNC(lpc47m192_kbdc_device::status_64r), FUNC(lpc47m192_kbdc_device::command_64w));
	}

	map(m_a20_ioaddr + 0, m_a20_ioaddr + 0).rw(FUNC(lpc47m192_device::io92_r), FUNC(lpc47m192_device::io92_w));

	//if(m_game_enabled && m_game_ioaddr >= lpc47m192_device::IOADDR_MIN)

	if(m_runtime_enabled && m_runtime_ioaddr >= lpc47m192_device::IOADDR_MIN)
	{
		map(m_runtime_ioaddr + 0, m_runtime_ioaddr + (RUNTIME_BLOCK_SIZE - 1)).rw(FUNC(lpc47m192_device::runtime_r), FUNC(lpc47m192_device::runtime_w));
	}

	//if(m_midi_enabled && m_midi_ioaddr >= lpc47m192_device::IOADDR_MIN)
}

void lpc47m192_device::config_w(uint8_t data)
{
	if(data == lpc47m192_device::CONFIG_STATE_EXIT)
	{
		m_config_state = 0x00;
		m_config_enabled = false;

		if(m_pending_remap)
		{
			lpc47m192_device::remap(AS_IO, 0x0000, 0xffff);
			m_pending_remap = false;
		}
	}
	else
	{
		m_config_state = data;
	}
}

void lpc47m192_device::index_w(uint8_t data)
{
	if (!m_config_enabled)
		m_config_enabled = (data == lpc47m192_device::CONFIG_STATE_ENTER);
	else
		lpc47m192_device::config_w(data);
}

uint8_t lpc47m192_device::config_data_fdd_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_FDD_ENABLED:
			return m_fdd_enabled;

		case lpc47m192_device::CONFIG_FDD_IOADDR_HIGH:
			return ((m_fdd_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_FDD_IOADDR_LOW:
			return ((m_fdd_ioaddr >> 0x00) & 0xff);

		case lpc47m192_device::CONFIG_FDD_INT_SEL:
			return m_fdd_int_sel;

		case lpc47m192_device::CONFIG_FDD_DMA_CHAN_SEL:
			return m_fdd_dma_chan_sel;

		case lpc47m192_device::CONFIG_FDD_MODE:
			return m_fdd_mode;

		case lpc47m192_device::CONFIG_FDD_OPTION:
			return m_fdd_option;

		case lpc47m192_device::CONFIG_FDD_TYPE:
			return m_fdd_type;

		case lpc47m192_device::CONFIG_FDD_0:
			return m_fdd_0;

		case lpc47m192_device::CONFIG_FDD_1:
			return m_fdd_1;
	}

	return 0x00;
}

void lpc47m192_device::config_data_fdd_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_FDD_ENABLED:
			m_fdd_enabled = data & 0x01;
			if(m_fdd_enabled)
				logerror("%s: WARNING: wants to activate fdd port @ 0x%04x to 0x%04x\n", tag(), m_fdd_ioaddr, m_fdd_ioaddr + lpc47m192_device::IOADDR_FDD_ALIGN);
			break;

		case lpc47m192_device::CONFIG_FDD_IOADDR_HIGH:
			m_fdd_ioaddr = (m_fdd_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_fdd_ioaddr &= (~(lpc47m192_device::IOADDR_FDD_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_FDD_IOADDR_LOW:
			m_fdd_ioaddr = (m_fdd_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_fdd_ioaddr &= (~(lpc47m192_device::IOADDR_FDD_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_FDD_INT_SEL:
			m_fdd_int_sel = data;
			break;

		case lpc47m192_device::CONFIG_FDD_DMA_CHAN_SEL:
			m_fdd_dma_chan_sel = data;
			break;

		case lpc47m192_device::CONFIG_FDD_MODE:
			m_fdd_mode = data;
			break;

		case lpc47m192_device::CONFIG_FDD_OPTION:
			m_fdd_option = data;
			break;

		case lpc47m192_device::CONFIG_FDD_TYPE:
			m_fdd_type = data;
			break;

		case lpc47m192_device::CONFIG_FDD_0:
			m_fdd_0 = data;
			break;

		case lpc47m192_device::CONFIG_FDD_1:
			m_fdd_1 = data;
			break;
	}
}

uint8_t lpc47m192_device::config_data_parallel_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_PARALLEL_ENABLED:
			return m_parallel_enabled;

		case lpc47m192_device::CONFIG_PARALLEL_IOADDR_HIGH:
			return ((m_parallel_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_PARALLEL_IOADDR_LOW:
			return ((m_parallel_ioaddr >> 0x00) & 0xff);

		case lpc47m192_device::CONFIG_PARALLEL_INT_SEL:
			return m_parallel_int_sel;

		case lpc47m192_device::CONFIG_PARALLEL_DMA_CHAN_SEL:
			return m_parallel_dma_chan_sel;

		case lpc47m192_device::CONFIG_PARALLEL_MODE1:
			return m_parallel_mode1;

