wtvemac/mame/src/mame/webtv/lpc47m192.cpp
		case lpc47m192_device::CONFIG_PARALLEL_MODE2:
			return m_parallel_mode2;
	}

	return 0x00;
}

void lpc47m192_device::config_data_parallel_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_PARALLEL_ENABLED:
			m_parallel_enabled = data & 0x01;
			if(m_parallel_enabled)
			{
				logerror("%s: NOTE: activating parallel @ 0x%04x to 0x%04x\n", tag(), m_parallel_ioaddr, m_parallel_ioaddr + lpc47m192_device::IOADDR_PARALLEL_ALIGN);
				lpc47m192_device::remap(AS_IO, 0x0000, 0xffff);
			}
			break;

		case lpc47m192_device::CONFIG_PARALLEL_IOADDR_HIGH:
			m_parallel_ioaddr = (m_parallel_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_parallel_ioaddr &= (~(lpc47m192_device::IOADDR_PARALLEL_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_PARALLEL_IOADDR_LOW:
			m_parallel_ioaddr = (m_parallel_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_parallel_ioaddr &= (~(lpc47m192_device::IOADDR_PARALLEL_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_PARALLEL_INT_SEL:
			m_parallel_int_sel = data;
			break;

		case lpc47m192_device::CONFIG_PARALLEL_DMA_CHAN_SEL:
			m_parallel_dma_chan_sel = data;
			break;

		case lpc47m192_device::CONFIG_PARALLEL_MODE1:
			m_parallel_mode1 = data;
			break;

		case lpc47m192_device::CONFIG_PARALLEL_MODE2:
			m_parallel_mode2 = data;
			break;
	}
}

uint8_t lpc47m192_device::config_data_serial1_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_SERIAL1_ENABLED:
			return m_serial1_enabled;

		case lpc47m192_device::CONFIG_SERIAL1_IOADDR_HIGH:
			return ((m_serial1_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_SERIAL1_IOADDR_LOW:
			return ((m_serial1_ioaddr >> 0x00) & 0xff);

		case lpc47m192_device::CONFIG_SERIAL1_INT_SEL:
			return m_serial1_int_sel;

		case lpc47m192_device::CONFIG_SERIAL1_MODE:
			return m_serial1_mode;
	}

	return 0x00;
}

void lpc47m192_device::config_data_serial1_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_SERIAL1_ENABLED:
			m_serial1_enabled = data & 0x01;
			if(m_serial1_enabled)
			{
				logerror("%s: NOTE: activating serial1 port @ 0x%04x to 0x%04x\n", tag(), m_serial1_ioaddr, m_serial1_ioaddr + lpc47m192_device::IOADDR_SERIAL1_ALIGN);
				lpc47m192_device::remap(AS_IO, 0x0000, 0xffff);
			}
			break;

		case lpc47m192_device::CONFIG_SERIAL1_IOADDR_HIGH:
			m_serial1_ioaddr = (m_serial1_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_serial1_ioaddr &= (~(lpc47m192_device::IOADDR_SERIAL1_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_SERIAL1_IOADDR_LOW:
			m_serial1_ioaddr = (m_serial1_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_serial1_ioaddr &= (~(lpc47m192_device::IOADDR_SERIAL1_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_SERIAL1_INT_SEL:
			m_serial1_int_sel = data;
			break;

		case lpc47m192_device::CONFIG_SERIAL1_MODE:
			m_serial1_mode = data;
			break;
	}
}

uint8_t lpc47m192_device::config_data_serial2_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_SERIAL2_ENABLED:
			return m_serial2_enabled;

		case lpc47m192_device::CONFIG_SERIAL2_IOADDR_HIGH:
			return ((m_serial2_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_SERIAL2_IOADDR_LOW:
			return ((m_serial2_ioaddr >> 0x00) & 0xff);

		case lpc47m192_device::CONFIG_SERIAL2_INT_SEL:
			return m_serial2_int_sel;

		case lpc47m192_device::CONFIG_SERIAL2_MODE:
			return m_serial2_mode;

		case lpc47m192_device::CONFIG_SERIAL2_IR_OPTIONS:
			return m_serial2_ir_options;

		case lpc47m192_device::CONFIG_SERIAL2_IR_HDTIMEOUT:
			return m_serial2_ir_hdtimeout;
	}

	return 0x00;
}

void lpc47m192_device::config_data_serial2_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_SERIAL2_ENABLED:
			m_serial2_enabled = data & 0x01;
			if(m_serial2_enabled)
			{
				logerror("%s: NOTE: activating serial2 port @ 0x%04x to 0x%04x\n", tag(), m_serial2_ioaddr, m_serial2_ioaddr + lpc47m192_device::IOADDR_SERIAL2_ALIGN);
				lpc47m192_device::remap(AS_IO, 0x0000, 0xffff);
			}
			break;

		case lpc47m192_device::CONFIG_SERIAL2_IOADDR_HIGH:
			m_serial2_ioaddr = (m_serial2_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_serial2_ioaddr &= (~(lpc47m192_device::IOADDR_SERIAL2_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_SERIAL2_IOADDR_LOW:
			m_serial2_ioaddr = (m_serial2_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_serial2_ioaddr &= (~(lpc47m192_device::IOADDR_SERIAL2_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_SERIAL2_INT_SEL:
			m_serial2_int_sel = data;
			break;

		case lpc47m192_device::CONFIG_SERIAL2_MODE:
			m_serial2_mode = data;
			break;

		case lpc47m192_device::CONFIG_SERIAL2_IR_OPTIONS:
			m_serial2_ir_options = data;
			break;

		case lpc47m192_device::CONFIG_SERIAL2_IR_HDTIMEOUT:
			m_serial2_ir_hdtimeout = data;
			break;
	}
}

uint8_t lpc47m192_device::config_data_kbd_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_KBD_ENABLED:
			return m_kbd_enabled;

		case lpc47m192_device::CONFIG_KBD_PRI_INT_SEL:
			return m_kbd_pri_int_sel;

		case lpc47m192_device::CONFIG_KBD_SEC_INT_SEL:
			return m_kbd_sec_int_sel;

		case lpc47m192_device::CONFIG_KBD_RESET_AND_A20_SEL:
			return m_kbd_reset_and_a20_sel;
	}

	return 0x00;
}

void lpc47m192_device::config_data_kbd_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_KBD_ENABLED:
			m_kbd_enabled = data & 0x01;
			if(m_kbd_enabled)
			{
				logerror("%s: NOTE: activating kbd port @ 0x60, 0x64\n", tag());
				lpc47m192_device::remap(AS_IO, 0x0000, 0xffff);
			}
			break;

		case lpc47m192_device::CONFIG_KBD_PRI_INT_SEL:
			m_kbd_pri_int_sel = data;
			break;

		case lpc47m192_device::CONFIG_KBD_SEC_INT_SEL:
			m_kbd_sec_int_sel = data;
			break;

		case lpc47m192_device::CONFIG_KBD_RESET_AND_A20_SEL:
			m_kbd_reset_and_a20_sel = data;
			break;
	}
}

uint8_t lpc47m192_device::config_data_game_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_GAME_ENABLED:
			return m_game_enabled;

