wtvemac/mame/src/mame/webtv/lpc47m192.cpp
		case lpc47m192_device::CONFIG_GAME_IOADDR_HIGH:
			return ((m_game_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_GAME_IOADDR_LOW:
			return ((m_game_ioaddr >> 0x00) & 0xff);
	}

	return 0x00;
}

void lpc47m192_device::config_data_game_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_GAME_ENABLED:
			m_game_enabled = data & 0x01;
			if(m_game_enabled)
				logerror("%s: WARNING: wants to activate game port @ 0x%04x to 0x%04x\n", tag(), m_game_ioaddr, m_game_ioaddr + lpc47m192_device::IOADDR_MIDI_ALIGN);
			break;

		case lpc47m192_device::CONFIG_GAME_IOADDR_HIGH:
			m_game_ioaddr = (m_game_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_game_ioaddr &= (~(lpc47m192_device::IOADDR_MIDI_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_GAME_IOADDR_LOW:
			m_game_ioaddr = (m_game_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_game_ioaddr &= (~(lpc47m192_device::IOADDR_MIDI_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;
	}
}

uint8_t lpc47m192_device::config_data_runtime_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_RUNTIME_ENABLED:
			return m_midi_enabled;

		case lpc47m192_device::CONFIG_RUNTIME_IOADDR_HIGH:
			return ((m_runtime_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_RUNTIME_IOADDR_LOW:
			return ((m_runtime_ioaddr >> 0x00) & 0xff);

		case lpc47m192_device::CONFIG_RUNTIME_CLOCKI32:
			return m_runtime_clocki32;
	}
	return 0x00;
}

void lpc47m192_device::config_data_runtime_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_RUNTIME_ENABLED:
			m_runtime_enabled = data & 0x01;
			if(m_runtime_enabled)
			{
				logerror("%s: NOTE: activating runtime (pme, leds, fan control etc...) port @ 0x%04x to 0x%04x\n", tag(), m_runtime_ioaddr, m_runtime_ioaddr + lpc47m192_device::IOADDR_RUNTIME_ALIGN);
				lpc47m192_device::remap(AS_IO, 0x0000, 0xffff);
			}
			break;

		case lpc47m192_device::CONFIG_RUNTIME_IOADDR_HIGH:
			m_runtime_ioaddr = (m_runtime_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_runtime_ioaddr &= (~(lpc47m192_device::IOADDR_RUNTIME_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_RUNTIME_IOADDR_LOW:
			m_runtime_ioaddr = (m_runtime_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_runtime_ioaddr &= (~(lpc47m192_device::IOADDR_RUNTIME_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_RUNTIME_CLOCKI32:
			m_runtime_clocki32 = data;
			break;
	}
}

uint8_t lpc47m192_device::config_data_midi_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_MIDI_ENABLED:
			return m_midi_enabled;

		case lpc47m192_device::CONFIG_MIDI_IOADDR_HIGH:
			return ((m_midi_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_MIDI_IOADDR_LOW:
			return ((m_midi_ioaddr >> 0x00) & 0xff);

		case lpc47m192_device::CONFIG_MIDI_INT_SEL:
			return m_midi_int_sel;
	}

	return 0x00;
}

void lpc47m192_device::config_data_midi_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_MIDI_ENABLED:
			m_midi_enabled = data & 0x01;
			if(m_midi_enabled)
				logerror("%s: WARNING: wants to activate midi port @ 0x%04x to 0x%04x\n", tag(), m_midi_ioaddr, m_midi_ioaddr + lpc47m192_device::IOADDR_MIDI_ALIGN);
			break;

		case lpc47m192_device::CONFIG_MIDI_IOADDR_HIGH:
			m_midi_ioaddr = (m_midi_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_midi_ioaddr &= (~(lpc47m192_device::IOADDR_MIDI_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_MIDI_IOADDR_LOW:
			m_midi_ioaddr = (m_midi_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_midi_ioaddr &= (~(lpc47m192_device::IOADDR_MIDI_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_MIDI_INT_SEL:
			m_midi_int_sel = data;
			break;
	}
}

uint8_t lpc47m192_device::config_data_ldevice_r()
{
	switch(m_selected_ldevice)
	{
		case LDEVICE_FDD:
			return lpc47m192_device::config_data_fdd_r();

		case LDEVICE_parallel:
			return lpc47m192_device::config_data_parallel_r();

		case LDEVICE_SERIAL1:
			return lpc47m192_device::config_data_serial1_r();

		case LDEVICE_SERIAL2:
			return lpc47m192_device::config_data_serial2_r();

		case LDEVICE_KBD:
			return lpc47m192_device::config_data_kbd_r();

		case LDEVICE_GAME:
			return lpc47m192_device::config_data_game_r();

		case LDEVICE_RUNTIME:
			return lpc47m192_device::config_data_runtime_r();

		case LDEVICE_MIDI:
			return lpc47m192_device::config_data_midi_r();

		default:
			return 0x00;
	}
}

void lpc47m192_device::config_data_ldevice_w(uint8_t data)
{
	switch(m_selected_ldevice)
	{
		case LDEVICE_FDD:
			lpc47m192_device::config_data_fdd_w(data);
			break;

		case LDEVICE_parallel:
			lpc47m192_device::config_data_parallel_w(data);
			break;

		case LDEVICE_SERIAL1:
			lpc47m192_device::config_data_serial1_w(data);
			break;

		case LDEVICE_SERIAL2:
			lpc47m192_device::config_data_serial2_w(data);
			break;

		case LDEVICE_KBD:
			lpc47m192_device::config_data_kbd_w(data);
			break;

		case LDEVICE_GAME:
			lpc47m192_device::config_data_game_w(data);
			break;

		case LDEVICE_RUNTIME:
			lpc47m192_device::config_data_runtime_w(data);
			break;

		case LDEVICE_MIDI:
			lpc47m192_device::config_data_midi_w(data);
			break;

		default:
			break;
	}
}

uint8_t lpc47m192_device::config_data_r()
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_GLOBAL_CONFIG_CONTROL:
			return m_config_control; // write only but adding read anyway.

		case lpc47m192_device::CONFIG_GLOBAL_LDEVICE_SEL:
			return m_selected_ldevice;

		case lpc47m192_device::CONFIG_GLOBAL_DEVICE_ID:
			return m_device_id;

		case lpc47m192_device::CONFIG_GLOBAL_DEVICE_REV:
			return m_device_rev;

		case lpc47m192_device::CONFIG_GLOBAL_POWER_CONTROL:
			return m_power_control;

