wtvemac/mame/src/mame/webtv/lpc47m192.cpp
		case lpc47m192_device::CONFIG_GLOBAL_POWER_MGMT:
			return m_power_mgmt;

		case lpc47m192_device::CONFIG_GLOBAL_OSC:
			return m_osc;

		case lpc47m192_device::CONFIG_GLOBAL_IOADDR_LOW:
			return ((m_config_ioaddr >> 0x00) & 0xff);

		case lpc47m192_device::CONFIG_GLOBAL_IOADDR_HIGH:
			return ((m_config_ioaddr >> 0x08) & 0xff);

		case lpc47m192_device::CONFIG_GLOBAL_TEST6:
			return 0x00;
		case lpc47m192_device::CONFIG_GLOBAL_TEST5:
			return 0x00;
		case lpc47m192_device::CONFIG_GLOBAL_TEST1:
			return 0x00;
		case lpc47m192_device::CONFIG_GLOBAL_TEST2:
			return 0x00;
		case lpc47m192_device::CONFIG_GLOBAL_TEST3:
			return 0x00;

		default:
			return lpc47m192_device::config_data_ldevice_r();
	}
}

void lpc47m192_device::config_data_w(uint8_t data)
{
	switch(m_config_state)
	{
		case lpc47m192_device::CONFIG_GLOBAL_CONFIG_CONTROL:
			m_config_control = data;
			break;

		case lpc47m192_device::CONFIG_GLOBAL_LDEVICE_SEL:
			m_selected_ldevice = data;
			break;

		case lpc47m192_device::CONFIG_GLOBAL_DEVICE_ID:
			// nop
			break;

		case lpc47m192_device::CONFIG_GLOBAL_DEVICE_REV:
			// nop
			break;

		case lpc47m192_device::CONFIG_GLOBAL_POWER_CONTROL:
			m_power_control = data & lpc47m192_device::PCONTROL_MASK;
			break;

		case lpc47m192_device::CONFIG_GLOBAL_POWER_MGMT:
			m_power_mgmt = data & lpc47m192_device::PMGMT_MASK;
			break;

		case lpc47m192_device::CONFIG_GLOBAL_OSC:
			m_osc = data & lpc47m192_device::OSC_MASK;
			break;

		case lpc47m192_device::CONFIG_GLOBAL_IOADDR_LOW:
			m_config_ioaddr = (m_config_ioaddr & 0xff00) | ((uint16_t)data << 0x00);
			m_config_ioaddr &= (~(lpc47m192_device::IOADDR_CONFIG_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_GLOBAL_IOADDR_HIGH:
			m_config_ioaddr = (m_config_ioaddr & 0x00ff) | ((uint16_t)data << 0x08);
			m_config_ioaddr &= (~(lpc47m192_device::IOADDR_CONFIG_ALIGN - 1)) & lpc47m192_device::IOADDR_MASK;
			m_pending_remap = true;
			break;

		case lpc47m192_device::CONFIG_GLOBAL_TEST6:
			break;
		case lpc47m192_device::CONFIG_GLOBAL_TEST5:
			break;
		case lpc47m192_device::CONFIG_GLOBAL_TEST1:
			break;
		case lpc47m192_device::CONFIG_GLOBAL_TEST2:
			break;
		case lpc47m192_device::CONFIG_GLOBAL_TEST3:
			break;

		default:
			lpc47m192_device::config_data_ldevice_w(data);
			break;
	}
}

uint8_t lpc47m192_device::data_r()
{
	if (m_config_enabled)
		return lpc47m192_device::config_data_r();
	else
		return 0x00;
}

void lpc47m192_device::data_w(uint8_t data)
{
	if (m_config_enabled)
		lpc47m192_device::config_data_w(data);
}

uint8_t lpc47m192_device::io92_r()
{
	return REG92_DEFAULT_VALUE;
}

void lpc47m192_device::io92_w(uint8_t data)
{
	if(data & lpc47m192_device::REG92_ALT_A20_HIGH)
		lpc47m192_device::gate_a20_w(ASSERT_LINE);
	else
		lpc47m192_device::gate_a20_w(CLEAR_LINE);

	if(data & lpc47m192_device::REG92_ALT_RESET_HIGH)
	{
		lpc47m192_device::system_reset_w(ASSERT_LINE);

		popmessage("Software reset fired");

		machine().schedule_soft_reset();
	}
	else
	{
		lpc47m192_device::system_reset_w(CLEAR_LINE);
	}
}

void lpc47m192_device::irq_w(uint8_t irqno, int state)
{
	switch(irqno)
	{
		case 1:
			m_irq1_cb(state);
			break;

		case 2:
			m_irq2_cb(state);
			break;

		case 3:
			m_irq3_cb(state);
			break;

		case 4:
			m_irq4_cb(state);
			break;

		case 5:
			m_irq5_cb(state);
			break;

		case 6:
			m_irq6_cb(state);
			break;

		case 7:
			m_irq7_cb(state);
			break;

		case 8:
			m_irq9_cb(state);
			break;

		case 9:
			m_irq9_cb(state);
			break;

		case 10:
			m_irq10_cb(state);
			break;

		case 11:
			m_irq11_cb(state);
			break;

		case 12:
			m_irq12_cb(state);
			break;

		case 13:
			m_irq13_cb(state);
			break;

		case 14:
			m_irq14_cb(state);
			break;

		case 15:
			m_irq15_cb(state);
			break;

		default:
			break;
	}
}

void lpc47m192_device::irq_parallel_w(int state)
{
	if(m_parallel_int_sel > 0)
		lpc47m192_device::irq_w(m_parallel_int_sel, state);
}

void lpc47m192_device::irq_serial1_w(int state)
{
	if(m_serial1_int_sel > 0)
		lpc47m192_device::irq_w(m_serial1_int_sel, state);
	else if(m_serial1_mode & SERIAL1_MODE_SHARE_IRQ && m_serial2_int_sel > 0)
		lpc47m192_device::irq_w(m_serial2_int_sel, state);
}

void lpc47m192_device::irq_serial2_w(int state)
{
	if(m_serial2_int_sel > 0)
		lpc47m192_device::irq_w(m_serial2_int_sel, state);
	else if(m_serial1_mode & SERIAL1_MODE_SHARE_IRQ && m_serial1_int_sel > 0)
		lpc47m192_device::irq_w(m_serial1_int_sel, state);
}

void lpc47m192_device::irq_keyboard_w(int state)
{
	if(m_kbd_pri_int_sel > 0)
		lpc47m192_device::irq_w(m_kbd_pri_int_sel, state);
}

void lpc47m192_device::irq_mouse_w(int state)
{
	if(m_kbd_pri_int_sel > 0)
		lpc47m192_device::irq_w(m_kbd_pri_int_sel, state);
	/*
	if(m_kbd_sec_int_sel > 0)
		lpc47m192_device::irq_w(m_kbd_sec_int_sel, state);
	*/
}

void lpc47m192_device::system_reset_w(int state)
{
	m_system_reset_cb(state);
}

void lpc47m192_device::gate_a20_w(int state)
{
	m_gate_a20_cb(state);
}

uint8_t lpc47m192_device::runtime_r(offs_t offset)
{
	if(m_runtime_out_cb.isunset())
		return m_runtime_block[offset & (lpc47m192_device::RUNTIME_BLOCK_SIZE - 1)];
	else
		return m_runtime_in_cb(offset);
}

void lpc47m192_device::runtime_w(offs_t offset, uint8_t data)
{
	if(m_runtime_in_cb.isunset())
		m_runtime_block[offset & (lpc47m192_device::RUNTIME_BLOCK_SIZE - 1)] = data;
	else
		m_runtime_out_cb(offset, data);
}
